# 基本运算符

# 1.算数运算符
print(9 / 7) #输出结果为小数点
print(2 ** 3)
print(9 // 5)
print(9.0 // 5.0)
'''输出结果
1.8
8
1
1.0
'''

# 2.比较(关系运算符)


# 3.赋值运算符


# 4.逻辑运算符



# 5.位运算符
a = 60            # 60 = 0011 1100
b = 13            # 13 = 0000 1101
c = 0

# 运算和输出结果
c = a & b        # 12 = 0000 1100
c = a | b        # 61 = 0011 1101
c = a ^ b        # 49 = 0011 0001
c = ~a           # -61 = 1100 0011
c = a << 2       # 240 = 1111 0000
c = a >> 2       # 15 = 0000 1111


# 成员运算符
list1 = [1, 2, 3, 4, 5, 6]

print(3 in list1)         # True
print(10 in list1)        # False
print(10 not in list1)    # True


str1 = 'titanjun'
print('jun' in str1)       # True





